## About Lesson
Is lecture main ham seekhen gay k pandas library ko use karne ki tips and tricks kon konsi hyn.
Ye lecture long hyn tu ap se request hy is ko poora dekh k sath sath pactice b karen.

### 01- how to find the version of pandas

In [28]:
import pandas as pd
pd.__version__

'2.2.3'

another way

In [29]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : 0691c5cf90477d3503834d983f69350f250a6ff7
python                : 3.13.0
python-bits           : 64
OS                    : Windows
OS-release            : 11
Version               : 10.0.26100
machine               : AMD64
processor             : Intel64 Family 6 Model 142 Stepping 10, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_Pakistan.1252

pandas                : 2.2.3
numpy                 : 2.1.3
pytz                  : 2024.2
dateutil              : 2.9.0.post0
pip                   : 24.3.1
Cython                : None
sphinx                : None
IPython               : 8.28.0
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : None
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : 3.1.4
lxml.etree            : None
matplotlib            : 3.9.2
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.5
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : None
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : None
sqlalchemy            : None
tables                : None
tabulate              : 0.9.0
xarray                : None
xlrd                  : None
xlsxwriter            : None
zstandard             : None
tzdata                : 2024.2
qtpy                  : None
pyqt5                 : None

### 02 make data frames

In [30]:
pd.DataFrame(({'colum1': [1,2,3] , 'colum2': [4,5,6], 'colum3': [7,8,9]}))

   colum1  colum2  colum3
0       1       4       7
1       2       5       8
2       3       6       9

### numpy array use to create data frme

In [31]:
import numpy as np
arr = np.array([[1,2,3],[4,5,6],[7,8,9]])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [32]:
pd.DataFrame(arr)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [33]:
pd.DataFrame(np.random.rand(4,6))

          0         1         2         3         4         5
0  0.537757  0.895808  0.455553  0.415775  0.156584  0.613677
1  0.349178  0.880550  0.328396  0.563729  0.047127  0.014905
2  0.393130  0.278198  0.830839  0.051336  0.435795  0.687733
3  0.480451  0.861029  0.197965  0.318959  0.378786  0.182241

In [34]:
df = pd.DataFrame(np.random.rand(4,6), columns= ['A', 'B', 'C', 'D', 'E', 'F'])

### HOW TO RENAME COLUMNS?

In [35]:
df.rename(columns ={'A':'col_A','B': 'col_B', 'C': 'col_C', 'D':'col_D','E':'col_E','F':'col_F'}, inplace=True)

In [36]:
df

      col_A     col_B     col_C     col_D     col_E     col_F
0  0.516975  0.246387  0.203045  0.911642  0.509377  0.795017
1  0.453399  0.821390  0.576502  0.076129  0.653838  0.156005
2  0.824273  0.937369  0.143362  0.027102  0.875389  0.162705
3  0.751059  0.924709  0.091797  0.394008  0.684895  0.498558

### another way to change column name

In [37]:
df.columns=['col_aa','col_bb','col_cc','col_dd','col_ee','col_ff']
df

     col_aa    col_bb    col_cc    col_dd    col_ee    col_ff
0  0.516975  0.246387  0.203045  0.911642  0.509377  0.795017
1  0.453399  0.821390  0.576502  0.076129  0.653838  0.156005
2  0.824273  0.937369  0.143362  0.027102  0.875389  0.162705
3  0.751059  0.924709  0.091797  0.394008  0.684895  0.498558

### to replace character in a string

In [38]:
df.columns=df.columns.str.replace('_','-')
df

     col-aa    col-bb    col-cc    col-dd    col-ee    col-ff
0  0.516975  0.246387  0.203045  0.911642  0.509377  0.795017
1  0.453399  0.821390  0.576502  0.076129  0.653838  0.156005
2  0.824273  0.937369  0.143362  0.027102  0.875389  0.162705
3  0.751059  0.924709  0.091797  0.394008  0.684895  0.498558

adding pre-fix

In [39]:
df.add_prefix('col_')

   col_col-aa  col_col-bb  col_col-cc  col_col-dd  col_col-ee  col_col-ff
0    0.516975    0.246387    0.203045    0.911642    0.509377    0.795017
1    0.453399    0.821390    0.576502    0.076129    0.653838    0.156005
2    0.824273    0.937369    0.143362    0.027102    0.875389    0.162705
3    0.751059    0.924709    0.091797    0.394008    0.684895    0.498558

4- using template data

In [40]:
import numpy as np
import seaborn as sns
kashti=sns.load_dataset('titanic')
kashti.head()
kashti.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [41]:
tips_data=sns.load_dataset('tips')
tips_data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [42]:
tips_data.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [43]:
tips_data.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

saving a template dataset

In [44]:
tips_data.to_csv('tips')

In [45]:
tips_data.to_excel('tips_exl.xlsx')

using your own data

In [46]:
df2= pd.read_csv('tips')
df2.head()

   Unnamed: 0  total_bill   tip     sex smoker  day    time  size
0           0       16.99  1.01  Female     No  Sun  Dinner     2
1           1       10.34  1.66    Male     No  Sun  Dinner     3
2           2       21.01  3.50    Male     No  Sun  Dinner     3
3           3       23.68  3.31    Male     No  Sun  Dinner     2
4           4       24.59  3.61  Female     No  Sun  Dinner     4

6- reverse row order

In [47]:
df3= sns.load_dataset("tips")
df3.loc[::-1].head()

     total_bill   tip     sex smoker   day    time  size
243       18.78  3.00  Female     No  Thur  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
240       27.18  2.00  Female    Yes   Sat  Dinner     2
239       29.03  5.92    Male     No   Sat  Dinner     3

7- reverse column

In [48]:
df.loc[:,::-1]

     col-ff    col-ee    col-dd    col-cc    col-bb    col-aa
0  0.795017  0.509377  0.911642  0.203045  0.246387  0.516975
1  0.156005  0.653838  0.076129  0.576502  0.821390  0.453399
2  0.162705  0.875389  0.027102  0.143362  0.937369  0.824273
3  0.498558  0.684895  0.394008  0.091797  0.924709  0.751059

8- select a column by data type

In [49]:
df.dtypes

col-aa    float64
col-bb    float64
col-cc    float64
col-dd    float64
col-ee    float64
col-ff    float64
dtype: object

only select those having numeric type

In [50]:
df.select_dtypes(include=['number']).head()

     col-aa    col-bb    col-cc    col-dd    col-ee    col-ff
0  0.516975  0.246387  0.203045  0.911642  0.509377  0.795017
1  0.453399  0.821390  0.576502  0.076129  0.653838  0.156005
2  0.824273  0.937369  0.143362  0.027102  0.875389  0.162705
3  0.751059  0.924709  0.091797  0.394008  0.684895  0.498558

to exclude any column based on dtype

In [51]:
df.select_dtypes(exclude=['number']).head()

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

9- convert string into numbers

In [52]:
df=pd.DataFrame({'col_A':[1,2,3,4,5],
                 'col_B':['6','5','4','8','5']})
df

   col_A col_B
0      1     6
1      2     5
2      3     4
3      4     8
4      5     5

In [53]:
df.dtypes

col_A     int64
col_B    object
dtype: object

In [54]:
df.astype({'col_B': 'int64'})
df.dtypes

col_A     int64
col_B    object
dtype: object

In [55]:
df.astype({'col_B': 'int64'})

   col_A  col_B
0      1      6
1      2      5
2      3      4
3      4      8
4      5      5

10- reduce dataframe size

In [56]:
df=sns.load_dataset('titanic')
df.shape

(891, 15)

In [59]:
df.sample(frac=0.1).shape

(89, 15)

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

11- copy data from clip board

In [63]:
df= sns.load_dataset('titanic')
df.to_excel('kashti.xlsx')